<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Author" CONTENT="Jean-Michel Couvreur">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.02 [en] (Win95; I) [Netscape]">
   <TITLE>Plan de d&eacute;veloppement</TITLE>
</HEAD>
<BODY>

<CENTER><FONT SIZE=+4>Plan de d&eacute;veloppement</FONT></CENTER>

<CENTER>
<HR WIDTH="100%"></CENTER>

<H1>
1- Description g&eacute;n&eacute;rale</H1>
<justify>
Suite &agrave; une longue r&eacute;flexion, le projet que nous avons choisi de d&eacute;velopper se porte sur un site de r&eacute;seau social bas&eacute; sur le concept de photos &agrave; noter. En effet, notre choix a port&eacute; vers ce site, car actuellement il manque ce type de fonctionnalit&eacute;s  propos&eacute; par les principaux acteurs de r&eacute;seaux sociaux. De plus, pour offrir une exp&eacute;rience utilisateur fluide, rapide, facile et fun, nous avons d&eacute;cid&eacute; de mettre en place ce système de notes (entre 1 et 5). <br>
L’objectif principal est de permettre aux utilisateurs de connaitre l’avis de ses amis, ainsi que celui d’autres utilisateurs sur des sujets illustr&eacute;s &agrave; travers une photo ou une vid&eacute;o, qui l’intriguent. Les notes entre 1 et 5 permettent de connaitre le degr&eacute; d’appr&eacute;ciation d’autres utilisateurs concernant les interrogations de l’utilisateur. Ils pourront &eacute;galement laisser un commentaire s’ils le souhaitent. Ce site est destin&eacute; &agrave; tout type de public, mais principalement aux jeunes utilisateurs. L’utilisateur doit en premier temps être inscrit pour être actif sur le site. <br>
<br>
En effet un utilisateur peut poster un fichier (photo/vid&eacute;o/audio) avec une description et y d&eacute;finir les critères &agrave; noter, ainsi que le public autoris&eacute; &agrave; voir et &agrave; noter. Il a ensuite la possibilit&eacute; de demander le contact &agrave; ceux qui le notent. Le compte contact&eacute; ne sera visible que si celui-ci en donne l’autorisation.
L’utilisateur peut aussi faire une recherche par mot cl&eacute;s pour trouver les photos qui l’int&eacute;ressent et donner une note pour chaque critère des photos entre 1 et 5. <br>
Par exemple, une jeune fille inscrite sur le site veut sortir en soir&eacute;e, mais ne sais pas quelle tenue mettre. Elle poste donc une photo avec sa robe, ses chaussures, sa coiffure et demande l’avis des autres utilisateurs (amis ou autres) sur les critères qui l'int&eacute;ressent, comme la couleur de sa robe, des chaussures, etc...<br>
Dans le cas où nos utilisateurs auraient des difficult&eacute;s &agrave; utiliser le site, une notice d’utilisation très simplifi&eacute;e sera mise &agrave; leur disposition dans leur profil.<br>
<br>
Pour faire connaître notre site nous envisageons dans un premier temps d’utiliser des mots cl&eacute;s pr&eacute;cis lors de la cr&eacute;ation du site dans le code html, ayant pour objectif de faciliter le r&eacute;f&eacute;rencement du site. Nous envisageons &eacute;galement de faire des publicit&eacute;s sur d’autres r&eacute;seaux sociaux. Par la suite, plus nos bases de donn&eacute;es seront grandes plus cela attirera d’utilisateurs. Ainsi, dans le futur, si le nombre d’utilisateurs augmente consid&eacute;rablement nous devrons augmenter les capacit&eacute;s de nos bases de donn&eacute;s et renforcer la s&eacute;curit&eacute; des donn&eacute;s. Dans un futur proche, si nous avons vraiment beaucoup plus de membres , il faudrait ajouter des fonctionnalit&eacute;s qui affichent des publicit&eacute;s. De plus, pour promouvoir notre site nous essayerons de faire appel &agrave; des c&eacute;l&eacute;brit&eacute;s françaises. Leur inscriptions peuvent augmenter la notori&eacute;t&eacute; du site, ainsi que motiver leurs fans &agrave; s’inscrire sur notre site.<br>
<br>
Notre projet est original du fait que les autres r&eacute;seaux sociaux ne proposent pas ce type de fonctionnalit&eacute;s, en effet il permet d’&eacute;valuer et connaître le degr&eacute; d’appr&eacute;ciation des personnes de manière pr&eacute;cise sur plusieurs aspects d’une photo simultan&eacute;ment (coupe de cheveux, couleur d’une voiture….). Ceci permet aussi de ne pas se restreindre &agrave; l’avis de ses amis de tous les jours et d’avoir un avis plus objectif. 
</justify>

<H1>2- Documentations</H1>
<ul>
    <li>Cours de G&eacute;nie logiciel de J-M Couvreur</li>
    <li>Cours d'Application Web de ... Bich Dao</li>
    <li><a href="http://www.w3schools.com" target="blank">www.w3schools.com</a> : tutoriels HTML, CSS, PHP</li>
<<<<<<< HEAD
    <li><a href="http://www.openclassrooms.com" target="blank">www.openclassrooms.com </a> Diverses questions de développement Informatique </li>
	<li><a href="http://www.commentcamarche.net/" target="blank">http://www.commentcamarche.net/ </a> : Diverses questions de développement Informatique</li>
	<li><a href="https://github.com/" target="blank">https://github.com/</a> : Service web d'hébergement et de gestion de développement de logiciels</li>
	<li><a href="http://www.free.fr/adsl/pages/internet/votre-web/10go-d-espace-disque.html" target="blank">http://www.free.fr/adsl/pages/internet/votre-web/10go-d-espace-disque.html </a> : Informations sur le site d'hébergement Free</li>
	<li><a href = "https://subscribe.free.fr/accesgratuit/"/> https://subscribe.free.fr/accesgratuit/</a>Inscription Free : hébergement gratuit</li>
	<li><a href = "https://subscribe.free.fr/login/">https://subscribe.free.fr/login/ </a> : Connexion au site d'hébergement de Free</li>
	
=======
    <li><a href="http://www.openclassrooms.com" target="blank">www.openclassrooms.com</a></li>
>>>>>>> 76ee04d6197cd802d51bcaf6d0ebdd405c666308
</ul>

<H1>3- Ressources</H1>
(Description des ressources humaines et mat&eacute;riels. Donner et d&eacute;finir le r&ocirc;le des intervenants)
<u>Ressources mat&eacute;riels:</u>
<ul>
<li>Google Drive : Partage de documents </li>
<li>[mettre configuration ordi de chacun] </li>
<li>Serveur Free </li>
<li>PowerPoint : conception du prototype papier </li>
<li>Microsoft Word </li>
<li>GanttProject : Diagramme de Gantt pour le planning </li>
<li>WinDeign</li>
</ul>
<u>Ressources humaines:</u><br>
Groupe: (mettre role)
<ul>
    <li>Badeyan Garik : </li>
    <li>Benamara Ferhat : </li>
    <li>Benseghir Houssam : </li>
    <li>Bounabi Khayreddine : </li>
    <li>Coste Blanche : </li>
</ul>
Intervenants:
<ul>
    <li>Monsieur Jean-Michel Couvreur (G&eacute;nie logiciel)</li>
    <li></li>
</ul>

<H1>4- Planning</H1>
Le projet sera rendu le 11 avril 2015 au plus tard<br>
Liste des taches et assignation/planification des taches<br><br>
Planning initial, Planning final<br>
MCD,MLD<br>
<br>




<H1>
5- D&eacute;livrables</H1>

Description des d&eacute;livrables (cahier des charges, m&eacute;moire,
manuel utilisateur, pr&eacute;sentation)<br/>[mettre des liens]<br/>
<u>G&eacute;nie logiciel :</u><br/>
    Cahier des charges<br/>
    Rapport d'activit&eacute; :
    <ul>
       <li>Badeyan Garik </li>
       <li>Benamara Ferhat </li>
       <li>Benseghir Houssam </li>
       <li>Bounabi Khayreddine </li>
       <li>Coste Blanche</li>
    </ul>
    <br/>
<u>Applications Web : </u><br/>
    <a href="../pages_site/acceuil.html">site</a>

<HR WIDTH="100%">
<BR><A HREF="acceuil.htm"> Look&Note </A>
</BODY>
</HTML>
